package java1.과제.과제1;

public class 과제1 {

	/*
	1. 연사자 암기 확인 2인 1조
	
		
 	산술 * + / % -
 	
 	비교 > < >= <= != ==
 	
 	논리 && || !
 	
 	대입 = += -= *= /= %=
 	
 	증감 i++ ++i i-- --i
 	
 	삼항 조건 ? 참 : 거짓   조건 ? 참 : 조건 ? 참: 거짓
 	
 	연결 +
	
	2. p.73~ p.76
	
	문제 1 번 : 4
	
	문제 2 번 : 2,3,6,7
	
	문제 3번 :
			1byte	2byte	4byte	8byte
		정수 byte	short	int		long
					char
		
		실수					float	double
		
		논리 boolean(1비트)
		
		
	문제 4번 : 
			타입 : int, double
			변수 : age, price
			리터럴: 10, 3.14
		
	문제 5번 : 3번 ( 쇼트는 -부호가 있고 char는 자연수로만 표현되서 오류가 발생 될 것 같다.)
	
	
	문제 6번 : 3번
	
	문제 7번 : 4번
	
	문제 8번 : 3번
	
	문제 9번 : 1번
	
	문제 10번 : 1번 (바이트는 1byte 문자열은 char? (2byte)) [답 2번으로 int는 Integer 함수만 사용하여 변환 가능 ]
	
	문제 11번 : 13번, 16번
	
	
	*/
}
